var hours = ['0-1点','1-2点','2-3点','3-4点','4-5点','5-6点','6-7点','7-8点','8-9点','9-10点','10-11点','11-12点','12-13点','13-14点','14-15点',
	                '15-16点','16-17点','17-18点','18-19点','19-20点','20-21点','21-22点','22-23点','23-24点'];
//代缴卡
var sf_djk = [0,0,0,0,0,0,0,0,0,189,712,1382,2147,3158,4272,5874,7212,8234,9044,10155,11354,11945,11945,11945,11945];
//银联卡
var sf_ylk = [58,158,258,358,458,558,658,758,858,965,1080,1188,1295,1310,1414,1523,1635,1746,1854,3562,3662,3762,3862,3962,3962];
//支付宝
var sf_zfb = [65,115,215,315,425,550,650,780,895,905,1033,1150,1267,1367,1489,1521,1628,1736,1840,2655,2755,2855,2955,2955,2955];
//微信
var sf_wx =  [88,112,218,324,428,528,628,770,885,995,1076,1183,1297,1397,1414,1521,1628,1728,1800,2255,2355,2455,2455,2655,2655];
var bw_sy =  new Array();
for(var i=0;i<hours.length;i++){
	bw_sy[i] = sf_djk[i] + sf_ylk[i] + sf_zfb[i] + sf_wx[i];
}

var bw_lyl = [70,72,72,73,75,80,81,50,49,56,60,61,60,57,55,50,49,46,47,50,55,59,65,68];
var bw_zyl = [77,79.2,79.2,80.3,82.5,88,89.1,55,53.9,61.6,66,67.1,66,62.7,60.5,55,53.9,50.6,51.7,55,60.5,64.9,71.5,74.8];
var bw_zzl = [0.7,0.7,0.7,0.7,0.8,0.8,1,1.1,1.3,1.5,1.8,2,2.1,2.3,2.5,3,3.4,3.6,3,2,1.4,1.2,0.8,0.5];
var clqs_sr =[396,383,374,372,424,408,464,503,515,698,745,821,876,981,1055,1231,1424,1539,1257,807,572,538,373,236 ];
var clqs_sl =[179,193,201,203,234,250,358,402,554,535 ,735,824,850,910,1001,1235,1371,1421,1209,837, 579,449,285,175];

var date = new Date();
var nowhour = date.getHours();  

var chartData_sf_data = new Array();
for(var k=0;k<11;k++){ 
	chartData_sf_data[k]=new Array(); 
	for(var j=0;j<nowhour+1;j++){
		if(k==0){//时间点
			chartData_sf_data[k][j]=hours[j]; 
		}else if(k==1){//利用率
			chartData_sf_data[k][j]=bw_lyl[j]; 
		}else if(k==2){//占用率
			chartData_sf_data[k][j]=bw_zyl[j]; 
		}else if(k==3){//周转率
			chartData_sf_data[k][j]=bw_zzl[j]; 
		}else if(k==4){//收益
			chartData_sf_data[k][j]=bw_sy[j]; 
		}else if(k==5){//车辆趋势-驶入
			chartData_sf_data[k][j]=clqs_sr[j]; 
		}else if(k==6){//车辆趋势-驶离
			chartData_sf_data[k][j]=clqs_sl[j];
		}else if(k==7){//代缴卡
			chartData_sf_data[k][j]=sf_djk[j]
		}else if(k==8){//银联卡
			chartData_sf_data[k][j]=sf_ylk[j]
		}else if(k==9){//支付宝
			chartData_sf_data[k][j]=sf_zfb[j]
		}else if(k==10){//微信
			chartData_sf_data[k][j]=sf_wx[j]
		}		  
	}
}